{
    "base": [
        ["Расскажи о себе?", "Необходимо услышать краткую историю карьерного роста и фактов."],
        ["Почему ты ушел с предыдущего места работы?", "Необходимо понять причину"],
        ["Почему ты захотел работать в нашей компании?", "Необходимо понять причину"],
        ["Какую должность ты занимаешь?", "Переходим на профиль должности, которую озвучил сотрудник, после чего возвращаемся к базовым вопросам."],
        [
            "Какой у тебя общий стаж работы в подобной должности?",
            "Определяем общий стаж сотрудника и на сколько он компетентен для этой должности. <br />Требуемый стаж: <br />Руководитель проекта - от 3-6 лет <br />CEO и CTO - от 6 лет <br />HR-менеджер - от 3-х лет"
        ],
        ["Какие у тебя должностные обязанности?", "В нашей компании."],
        ["Ты считаешь что ты выполняешь свои обязанности?", "Убрать у сотрудника придуманый бейдж если он есть."],
        ["Почему ты считаешь что ты достоин этой должности?", "..."],
        ["Опиши компанию в которой ты работаешь своими словами", "..."],
        ["Чего или кого на твой взгляд не хватает в компании?", "..."],
        ["Представь что это твоя компания. Чтобы ты в ней изменил?", "..."],
        ["Как бы ты ее развивал?", "..."],
        ["Кого знаешь из сотрудников и какие у них должностные обязанности?", "..."],
        ["Расскажи о своих текущих задачах в компании и на каком они этапе?", "..."],
        ["Оцени свои навыки, свои опыт в денежном эквиваленте?", "..."],
        ["Какая у тебя заработная плата?", "..."],
        [
            "Какая заработная плата тебя устроила бы?",
            "Средняя заработная плата специалиста на рынке на 2021 год составляет: <br />- UI/UX-дизайнер - 150тр. <br />- Frontend разработчик <br />[<br />+ Cтажер - 30тр <br />+ Junior-разработчик - 50-80тр <br />+ Middle-разработчик - 80-120тр <br />+ Senior-разработчик - 180-300тр <br />] <br />- iOS / Android разработчик <br />[<br />+ Cтажер - 30тр <br />+ Junior-разработчик - 40-80тр <br />+ Middle-разработчик - 70-150тр <br />+ Senior-разработчик - 180-300тр <br />] <br />- HR менеджер - 30-50тр / полная занятость, удаленная работа <br />- Менеджер проектов/ IT Project Manager - 65-115тр"
        ],
        ["Какого числа происходит выплата? Тебе удобно получать выплату в эти дни?", "..."],
        ["Что нового ты можешь привнести в компанию и почему нам необходимо работать с тобой. Чем ты нам будешь полезен?", "..."]
    ],
    "ux": [
        [
            "Что такое UX-дизайн?",
            "UX-дизайн — это проектирование интерфейса на основе исследований пользовательского опыта и поведения. <br />UX (англ. user experience) дословно означает «опыт пользователя». Имеется ввиду весь опыт, который получает пользователь при взаимодействии с сайтом или приложением. UX-дизайн отвечает за функции, адаптивность продукта и то, какие эмоции он вызывает у пользователей. Чем понятнее интерфейс, тем легче пользователю получить результат и совершить целевое действие. <br />В UX-дизайне нужно изучать привычки пользователей, разрабатывать прототипы поведения и проводить тестирование. Всей этой работой занимается UX-дизайнер."
        ],
        [
            "Кто такой UX-дизайнер?",
            "UX-дизайнер - это проектировщик, который изучает потребности пользователей, строит логические схемы работы интерфейса, тестирует прототипы на целевой аудитории и составляет техническое задание для UI-дизайнера. <br />UX-дизайнер — это специалист по проектированию пользовательских интерфейсов сайтов, программ и мобильных приложений. От него зависит, насколько удобным окажется интерфейс и сколько пользователей захочет совершить предложенное целевое действие — скачать файл, оформить заказ, перейти по ссылке и т.д."
        ],
        ["Что такое UI-дизайн?", "UI-дизайн — процесс визуализации прототипа, который разработали на основании пользовательского опыта и исследования целевой аудитории."],
        [
            "Что включает в себя UI-дизайн?",
            "UI-дизайн включает в себя работу над графической частью интерфейса: анимацией, иллюстрациями, кнопками, меню, слайдерами, фотографиями и шрифтами."
        ],
        [
            "Кто такой UI-дизайнер?",
            "UI-дизайнер определяет цветовую палитру и расположение объектов в интерфейсе: удобно ли нажимать «Заказать», правильно ли работает выпадающее меню, легко ли заполнять форму, хорошо ли читается текст со смартфона, какое сообщение выдаёт сайт при том или ином действии.     UI-дизайнер (англ. user interface designer) — дизайнер интерфейсов, который визуализирует рабочий прототип, отрисовывает кнопки, иконки, формы и другие его компоненты и собирает их в гармоничный работающий макет. <br />UI-дизайнер отвечает за то, как выглядит интерфейс продукта и как пользователь взаимодействует с его элементами. Для этого необходимо грамотно организовать элементы интерфейса и выдержать единые стиль и логику их взаимодействия."
        ],
        [
            "Основные требования к качественному UX/UI-дизайну?",
            "- Ясность (В интерфейсе нет двусмысленности, а текст и структура направляют пользователя к цели.) <br />- Лаконичность (Интерфейс не перегружен подсказками, всплывающими окнами и анимацией. Задавайте себе вопросы: «А нужно ли это здесь? Для чего?». Это поможет сфокусировать внимание пользователя на конкретном элементе.) <br />- Узнаваемость (Элементы дизайна легко распознать, даже если пользователь видит ваш сайт впервые. Делайте интерфейс интуитивно понятным. Например, не красьте кнопку подтверждения в оранжевый, если на большинстве сайтов она зелёная.) <br />- Отзывчивость (Хороший интерфейс реагирует на действия пользователя мгновенно. Он должен понимать, что происходит на экране прямо сейчас: прошла ли оплата, получил ли менеджер заявку, отправилось ли сообщение.) <br />- Постоянство (Соблюдайте постоянство для всех разделов сайта и приложения. Элементы интерфейса — меню и слайдеры — должны вести себя одинаково на любой странице.) <br />- Эстетика (Создавайте интерфейс визуально привлекательным, чтобы пользователю было приятно работать, ничто его не раздражало и не отвлекало от решения задач.) <br />- Эффективность (Помимо внешней привлекательности хороший интерфейс экономит время пользователя и доставляет его в нужную точку с минимальными усилиями.) <br />- Снисходительность (Даже при самом продуманном интерфейсе ни один пользователь не застрахован от ошибки. Продумайте заботливые сообщения на случай, если что-то пошло не так. Это поможет сохранить деньги, время и лояльность клиентов в случае сбоя.)"
        ],
        [
            "В чём разница между UX и UI?",
            "Разница между UX и UI — в том, что UX-дизайнер планирует, как пользователь взаимодействует с интерфейсом, какие шаги ему нужно предпринять, чтобы достичь цели. А UI-дизайнер продумывает, как эти шаги и путь к цели выглядят."
        ],
        [
            "Обязанности UX-дизайнера?",
            "- изучение поведения целевой аудитории и проработка пользовательских сценариев; <br />- проведение опросов среди пользователей и анализ полученных результатов; <br />- разработка концепций интерфейсов, реализация дизайна; <br />- отрисовка графических элементов интерфейса, создание макетов; <br />- проектирование интерфейсов под Web, iOS, Android; <br />- разработка интерактивных прототипов и макетов в Figma; <br />- юзабилити-тестирование прототипов на пользователях; <br />- тестирование интерфейсов, их оптимизация и доработка."
        ],
        ["Расскажи о своем реальном опыте и достижениях в этом направлении.", "..."],
        ["Какими инструментами создания прототипов интерфейсов ты пользуешься?", "Figma, Sketch, Illustrator, Adobe CС и др.;"],
        [
            "Есть ли опыт в создании UI элементов, иллюстраций, иконок?",
            "Мне нужна svg кнопка высотой .8em и шириной 2em с текстом внутри размер которого 18px (но в em) и насыщеность средняя. Заливка у этой кнопки прозрачная, а обводка размером 2px и градиентная в 90 градусов слева на право."
        ],
        ["Что такое Композиция?", "Композиция — это правильное сочетание графических элементов в едином целом."],
        ["Что такое Юзабилити?", "Юзабилити – это качественный показатель простоты и удобства использования."],
        [
            "Что такое кегль и интерлиньяж?",
            "Кегль — высота кегельной площадки, размер буквы или знака по вертикали. <br />Интерлиньяж — междустрочный интервал, расстояние между базовыми линиями соседних строк."
        ],
        [
            "Какими методами ты определяешь поведение пользователя?",
            "- Создание собирательного образа пользователя приложения. Для того, чтобы создать тип пользователя для своих тестов, необходимо тщательно исследовать свою аудиторию. Как же ты исследуешь китайского пользователя? <br />- Создание сценария примерного поведения пользователя исходя из полученых ранее данных.Сценарии описывают мотивы юзера для того, чтобы предложить возможные способы достижения его целей. Например, сценарий может описывать, как пользователь использует мобильное приложение для покупки авиабилета, пока идет на работу. <br />- Раскадровка. Визуальное представление структуры продукта основаной на действиях, которые должен выполнить пользователь в приложении."
        ],
        [
            "Что такое многовариантное тестирование?",
            "Это метод проверки, в котором изменяются сразу несколько показателей (то есть вносится ряд различных изменений в интерфейс продукта), после чего выпускается ряд приложений для всех возможных комбинаций. Идея состоит в том, чтобы помочь тебе выяснить, какой элемент экрана оказывает наибольшее влияние на коэффициент конверсии продукта."
        ],
        [
            "Как ты собираешься получать метрики с нашей аудитории?",
            "Метрика — это качественный или количественный показатель, который отражает ту или иную характеристику и уровень успешности продукта. Например: Метрики привлечения пользователей.Они помогают понять, как и откуда в продукт приходят пользователи, сколько их всего, какие из них активные."
        ],
        ["Как ты представляешь юзабилити-тестирование твоих прототипов на нашей аудитории?", "Без вариантов."],
        ["Мы можем себе такое позволить? Чтобы пользователю кидать тестовый интерфейс", "Я думаю нет."],
        [
            "Какие инструменты для отслеживания взаимодействия пользователей с продуктом ты используешь?",
            "UXcam, Repro, UserX, тепловые карты, просмотр записей сеансов и событий, метрики. Перечисленное ранее крайне дорогое и сильно нагружают смартфоны конечных пользователей приложения."
        ],
        ["Как ты собираешься интегрировать свой инструмент в наше мобильное приложение и сайты для сбора метрик?", "Мы не будем интегрировать что-то из этого."]
    ],
    "dev": [
        [
            "Что знаешь о классификации уровней разработчиков? Перечисли их все. Расскажи про каждую, о чем она?",
            "Junior-разработчик — (это новичок, который еще не может взять задачу «от и до», но при этом и не совсем зеленый боец. У джуна уже есть некоторый опыт, он может написать несложную логику на JS и каком-то из фреймворков. Он хорошо знает теорию, но еще плохо владеет алгоритмами, и ему обязательно нужен наставник.) <br />Middle-разработчик — (полноценная боевая единица, которой можно доверить задачу или часть проекта. Человек такого уровня сам найдет решение, исходя из своего опыта. Он уже знает не только базу JS, но и хорошо разбирается хотя бы в одном из фреймворков. Ему не нужен наставник, но еще требуется тимлид, который будет ревьюить его код и направлять дальше. Middle-разработчик пока не готов принимать архитектурные решения.) <br />Senior-разработчик — (человек с обширным кругозором, идеальным знанием теории и большим практическим опытом. Он глубоко понимает не только инструменты, но и подходы, может с легкостью объяснить, почему одно работает, а другое — нет. Специалист такого уровня может быстро оценить задачу, увидеть ошибку и исправить ее, он понимает архитектуру проекта и видит направления для его развития. Такой человек заранее догадывается о большинстве подводных камней разработки.)"
        ],
        [
            "Расскажи о своем стеке, чем владеешь и на каком уровне?",
            "Нам принципиально нужны Vue, React, TypeScript разработчики с уровнем классификации не ниже Middle-разработчик."
        ],
        ["Почему ты выбрал такой стек?", "Первое что попалось не подходит. Человек просто тратит свой и чужой рессурс."],
        [
            "Сколько ты работаешь с этим стеком?",
            "Не менее года наше требование. Т.к если стаж меньше, то человек еще не дошел до его подводных камней и не раскрыл основные возможности."
        ],
        ["Какими языками ты владеешь?", "HTML, CSS, JavaScript, C, Java, Python, C++, C#, PHP, Ruby, Golang, Haskel, Rust ..."],
        [
            "На каком уровне по 5-ти бальной шкале, где 0 - это абсолютно никак, а 5 - это смогу тебя научить?",
            "0 - абсолютно никак; <br />1 - что-то читал про это; <br />2 - делал по примеру на medium.com, <br />3 - почти получается что-то, <br />4 - готов работать в команде, <br />5 - могу тебя научить"
        ],
        [
            "Что такое DOM?",
            "HTML-код, который ты пишешь, анализируется и преобразуется браузером впоследствии в DOM-дерево. DOM — это независящий от платформы и языка программный интерфейс, позволяющий программам и скриптам получить доступ к содержимому HTML-, XHTML- и XML-документов, а также изменять содержимое, структуру и оформление таких документов. Если сказать по-простому, то HTML-код – это текст страницы, а DOM – это набор связанных объектов, созданных браузером при парсинге её текста."
        ],
        [
            "Объясни разницу между cookie, sessionStorage и localStorage.",
            "Отличие между этими хранилищами сводится только к периоду времени, в течение которого они могут хранить данные, помещенные в них. <b>SessionStorage</b> – выполняет это в течение сессии. Закрытие вкладки или браузера приводит их к удалению. <b>LocalStorage</b> – осуществляет это в течение неограниченного времени. Они сохраняются при перезагрузке браузера и компьютера. Их длительность хранения ничем не ограничена. <br />По размеру (cookies ограничены 4 Кбайт, а размер LocalStorage - 5 Мбайт). <b>Cookie</b> в отличие от данных локального хранилища включаются в состав запроса при отправке его на сервер, а также сервер их может добавлять в ответ при отправке его клиенту. <br /><b>По необходимости информирования пользователей Евросоюза (при использовании cookies, сайт в ЕС должен получать на это разрешение от пользователей.</b> <br />По назначению (куки в основном используются для управления сеансом, персонализации и отслеживания действий пользователя, в то время как LocalStorage применяется в качестве обычного локального хранилища информации на компьютере пользователя)."
        ],
        ["В чем разница между `атрибутом` (attribute) и `свойством` (property)?", "Атрибуты определены в разметке HTML, а свойства определены в DOM."],
        [
            "В чем разница между переменными, значение которых: `null`, `undefined`? Как бы ты проверил их на каждое из этих значений?",
            "Необъявленные переменные создаются, когда вы присваиваете значение идентификатору, который не был ранее создан при помощи var, let или const. Необъявленные переменные будут определены глобально, вне текущей области видимости. В строгом режиме, будет ошибка ReferenceError, когда вы попытаетесь назначить значение необъявленной переменной. Необъявленные переменные плохи так же, как и глобальные переменные. Избегайте их любой ценой! Чтобы проверить на их наличие, оберните код в блок try/catch. <br />Переменная <b>undefined</b> — это переменная, которая была объявлена, но ей не было присвоено значение. Ее тип undefined. Если переменной присвоить функцию, которая не возвращает никакого значения, то переменная также будет иметь значение undefined. Чтобы проверить это, сравните, используя оператор строгого равенства (===) или typeof, который вернет строку undefined.  <br />Переменной со значением <b>null</b> было явно присвоено значение null. Она отличается от undefined тем, что она была назначена явно. Чтобы проверить на null, просто сравните, используя оператор строгого равенства. Обратите внимание, что, как и выше, вы не должны использовать оператор абстрактного равенства (==) для проверки, так как он также вернет true, если значение равно undefined."
        ],
        [
            "В чем разница между циклом `.forEach` и циклом `.map()`?",
            "forEach перебирает элементы в массиве, вызывает callback-функцию для каждого элемента и не возвращает значение. <br />map перебирает элементы в массиве, сопоставляет каждый элемент с новым элементом, вызывая функцию для каждого элемента, создавая в результате новый массив."
        ],
        [
            "В чем разница между `==` и `===`?",
            "== — это оператор абстрактного сравнения, а === — оператор строгого сравнения. Оператор == будет сравнивать на равенство после выполнения любых необходимых преобразований типов. Оператор === не будет выполнять преобразование типов, поэтому, если два значения не одного типа, === просто вернет false."
        ],
        [
            "Что такое промисы(promises)",
            "Промис — это объект, который может вернуть одно значение в будущем: либо выполненное значение, либо причина, по которой оно не было выполнено (например, произошла ошибка сети). Промис может находиться в одном из 3 возможных состояний: выполнено, отклонено или ожидает выполнения."
        ],
        [
            "Объясни разницу между синхронными и асинхронными функциями",
            "<b>Синхронные функции</b> являются блокирующими, а асинхронные — нет. В синхронных функциях одна операция должна завершиться, прежде чем будет запущена следующая операция. В этом случае скрипт выполняется строго по порядку операций, и выполнение скрипта приостанавливается, если одна из операций занимает очень много времени. <br /><b>Асинхронные функции</b> обычно принимают callback-функцию в качестве параметра, и выполнение продолжается на следующей строке сразу после вызова асинхронной функции. Callback-функция вызывается только тогда, когда асинхронная операция завершена и стек вызовов пуст. Ресурсоемкие операции, такие как загрузка данных с веб-сервера или запросы к базе данных, должны выполняться асинхронно, чтобы основной поток мог продолжать выполнять другие операции вместо блокировки до завершения этой долгой операции (в случае браузеров пользовательский интерфейс будет зависать)."
        ],
        [
            "В чем различие между переменными, созданными при помощи `let`, `var` и `const`?",
            "Переменные, объявленные при помощи ключевого слова var, относятся к области видимости функции, в которой они созданы. Или, если они созданы вне какой-либо функции — к глобальному объекту. let и const относятся к блочной области видимости — это означает, что они доступны только в пределах ближайшего набора фигурных скобок."
        ]
    ],
    "project": [
        [
            "Кто такой Project manager?",
            "Project manager — это специалист, чьей главной задачей является управление проектом в целом: проектирование и расстановка приоритетов, планирование выполнения задач, контроль, коммуникации, а также оперативное решение проблем."
        ],
        ["Обязанности Project manager?", "Закончить проект в срок, используя необходимые ресурсы. Способность руководить командой, ответственный за ведение всего проекта."],
        [
            "Задачи Project manager?",
            "сбор и систематизация требований по проекту; <br />план выполнения работ, KPI, майндмэпы; <br />поиск исполнителей, фрилансеров, составление портрета искомого сотрудника для HR; <br />постановка задач и контроль сроков исполнения; <br />контроль расходования бюджета; <br />ведение документации по проекту (тз, договоры, акты, счета, сметы, отчеты)."
        ],
        [
            "Что должен уметь Project manager?",
            "Понимать реальные задачи и предлагать те решения, которые необходимы. <b>Он способен объяснить, например, почему дополнительные функции не являются обязательными на данном этапе разработки.</b> <br /><b>Обрабатывать задачи и делить их на небольшие подзадачи</b>, которые он делегирует исполнителям и добивается соблюдения дедлайнов. <br /><b>Видеть проект целиком.</b> В каждый момент времени он знает, на каком этапе находится работа, и понимает, что составленный план — не просто бумажка для отчета, а настоящая дорожная карта, по которой движется вся команда. <br /><b>Управлять рисками.</b> Для PM нет понятия «внезапно». Он может не знать, что конкретно пойдет не так, но должен быть готов к этому и иметь в запасе все ресурсы, которые позволят всё исправить."
        ],
        [
            "Какие этапы должен пройти сотрудник, чтобы стать Project manager?",
            "стажёр в отделе разработки; <br />младший разработчик; <br />разработчик; <br />старший разработчик; <br />руководитель группы разработчиков; <br />руководитель проекта."
        ],
        ["Одной из обязаностей руководителя проекта является управление назначеной командой. Как ты управляешь своей командой и своим проектом?", "Никак."]
    ],
    "product": [
        [
            "Кто такой Product manager?",
            "Product Manager (менеджер продукта) – больше про маркетинг, вывод продукта на рынок и получение выгоды. Product Manager работает с рынком, анализируя потребность, наличие конкурентов и прочие факторы, отвечает за видение и направление развития продукта (как правило, не спускаясь на технический уровень), определение ценовой и ассортиментной политики, работу с клиентами и выполнение поставленных KPI.  В общем, основная обязанность Product Manager – не просто создать продукт, а сделать его успешным на рынке и обеспечить возврат инвестиций."
        ],
        [
            "Обязанности Product manager?",
            "Создание и продвижение новых идей, реализация их в виде готового продукта или услуги <br />разработка линейки продуктов и услуг <br />план KPI и контроль за его четким исполнением <br />аналитика деятельности конкурентов и прогнозирование их активности, анализ сегмента рынка <br />политика ценообразования и прогноз жизненного цикла продукта <br />Определять объем работ для разработчиков и формировать беклог. <br />Управлять релизами, ставить задачи команде. <br />Создавать техническую документацию (пользовательские истории, видение, руководство для пользователей и т.д.) и четкие достижимые спецификации, чтобы команда выпускала ключевые функции вовремя и с максимальной ценностью для рынка. <br />Создавать рекомендации для маркетинговых стратегий с целью привлечения и удержания пользователей. <br />Формировать дорожную карту продукта. <br />Контролировать создание продукта от идеи до релиза. <br />Мотивировать команду.  "
        ],
        [
            "Задачи Product manager?",
            "Задача продакта — сделать продукт крутым и не расстраивать разработчика, ставя правильно задачи, распределяя время и обозначая приоритеты. Иначе будет мало фич и множество неисправленных багов."
        ],
        [
            "Что должен уметь Product manager?",
            "Видеть, каким должен быть результат, и знать, как команда будет его добиваться. Контролируя каждый этап, он корректирует курс и говорит, что делать дальше. Не управляет командой, а направляет и работает вместе с ней. Управлением занимается уже Project manager. Отвечает каким будет продукт. <br />Обязанности: <br />Видение продукта. Вы всегда представляете, как будет выглядеть продукт в итоге, и способны объяснить это другим. Важно сделать так, чтобы все в команде поняли задачи одинаково. <br />Ценность. Вы должны убедиться, что продукт будет ценен для пользователя. Не важно, какие методы вы будете применять для этого. <br />Бэклог. Вам придется слушать предложения команды, оценивать их и заносить в общий список задач и требований. Вы отвечаете за содержание бэклога и за изменения в нем. <br />Приоритеты. Только вы выбираете порядок, в котором команда будет работать. Всегда точно знаете, какие функции появятся у продукта первыми, а что можно дорабатывать потом. Задачи на каждый спринт тоже планируете вы. <br />Стратегия развития. Вам важно, что получается после каждой итерации. Вы проверяете качество продукта в конце спринта, и, если что-то идет не так, знаете, как это изменить. Прогресс продукта — это ваш личный прогресс. <br />Понимание. Именно вы следите, чтобы общение команды было продуктивным. Вам важно, чтобы все, кто создаёт продукт, могли обмениваться идеями и легко понимали друг друга. От этого зависит общий результат."
        ],
        ["В чем различие между Project / Product и Product owner?", ""],
        [
            "Что такое Scrum, Agile, Watterfall",
            "Это методологии.  <br /><a href='https://worksection.com/blog/waterfall-vs-agile.html'>waterfall-vs-agile</a>  <br /><a href='https://www.atlassian.com/ru/agile/scrum'>scrum</a>"
        ],
        [
            "Расскажи кратко про каждую из них?",
            "Scrum — методология гибкой разработки на основе Agile, в основе которого лежит «спринт» — отрезок от 1 до 4 недель, по окончанию которого должна быть получена рабочая версия продукта. <br />Agile — итеративный подход при работе над проектом. Твоя команда выпускает проект маленькими шагами с самого начала, а не показывает уже готовый продукт в самом конце. Ключевой принцип — разработка через короткие итерации (циклы), в конце каждого из которых заказчик (пользователь) получает рабочий код или продукт.  <br />Waterfall — методика управления проектами, которая подразумевает последовательный переход с одного этапа на другой без пропусков и возвращений на предыдущие стадии. Переход к новому этапу возможен только после завершения предыдущего."
        ],
        [
            "Что такое Project owner?",
            "Product- и Project-менеджер — это специальности или должности сотрудников, а Product owner — это роль в скрам-методологии. Таким образом, если команда работает не по Scrum, то и Product owner’а там быть не может. Product Owner (владелец продукта) – больше про управление проектом или набором проектов для создания и совершенствования продукта. Product Owner плотно работает с командой проекта (и имеет минимальные технические навыки, чтобы говорить с ними на одном языке, от разработки до UI/UX), решает, каким именно будет продукт, управляет бэклогом, взаимодействует с пользователями на всех этапах (от сбора требований до тестирования и получения обратной связи), иногда – контролирует бюджет на разработку продукта. В общем, основная обязанность Product Owner – получить работающий продукт, отвечающий ожиданиям пользователей, и, в идеале, даже их превышающий, и развивать его."
        ],
        ["Какую модель использует твоя команда и почему?", "..."],
        [
            "Кто такой Стейкхолдер?",
            "Стейкхолдеры (или заинтересованные лица) – это группы людей или отдельные люди, которых проект как-то затрагивает (как в хорошем, так и в плохом смысле) либо (и это важно, про это почему-то часто забывают!) те, кого проект не затрагивает, но они сами могут его «затронуть» или как-то на него повлиять, используя имеющиеся у них возможности."
        ],
        [
            "Что такое Бэклог?",
            "Бэклог (или баклог) - это журнал оставшейся работы, которую необходимо выполнить команде. Термин пришел из семейства методологий Agile, в частности из Scrum, где он является одним из основных артефактов - источником пользовательских историй."
        ],
        [
            "Что такое матрица распределения ответственности или RACI матрица?",
            "RACI матрица – простой и удобный инструмент для наглядного отображения распределения полномочий и ответственности в рамках проекта или бизнес-процесса. Чаще всего RACI матрица представляет собой табличку, где по вертикали расположены задачи или конкретные результаты, ожидаемые в ходе проекта, а по горизонтали – конкретные люди или роли (роли, конечно, предпочтительнее)."
        ],
        [
            "Как расшифровывается RACI?",
            "R (Responsible) – тот, кто будет делать работу. Например, модуль Х будет писать разработчик Вася. Для каждой задачи должен быть как минимум один “R”, можно больше. <br />A (Accountable) – тот, кто примет итоговую работу и будет нести за нее ответственность. Принимать у Васи модуль Х и отвечать перед руководителем проекта головой за то, что он заработает, будет его тимлид Петя. “А” для каждой задачи должен быть только один, отсутствовать “А”, также как и “R”, в задаче не может. В исключительных случаях (обычно для совсем маленьких команд) “А” и “R” будут одним и тем же человеком, тогда достаточно указать просто “А”. Но вообще это нехорошая практика. <br />C (Consulted) – тот, кто будет в обязательном порядке консультировать остальных при выполнении задачи. Чтобы модуль Х работал как надо, и Васе и Пете надо будет согласовать свои идеи по реализации с Инной, главной за информационную безопасность в компании, и Еленой, архитектором проекта. “C” в задаче может быть, а может и не быть. <br />I (Informed) – тот, кто должен быть в курсе принимаемых решений или хода выполнения задачи, но влиять на них никак не будет. Руководитель поддержки Иван, которого пользователи уже запинали в ожидании модуля Х, будет грустно читать статусы и рассылки о ходе разработки модуля, смотреть таски в JIRA и тяжело вздыхать. По аналогии с “C”, “I” в задаче может быть, а может и не быть. "
        ]
    ],
    "group": [
        ["Что такое PMF (Product-Market Fit)? ***", "Это - соответствие продукта рынку. Один из главных показателей успешности стартапа."],
        [
            "Как достичь PMF? ***",
            "Необходимо создать ценное предложение, <b>которое не может родиться из точечных поправок в продукте — например, изменения дизайна/цвета и пр.</b> <br />Три составляющих PMF: <br />— Клиент (вы знаете, кому нужен ваш продукт), <br />— Проблема (вы решаете конкретную проблему Клиента) <br />— Решение (Клиент готов платить за это Решение)."
        ],
        [
            "8 шагов к достижению PMF? ***",
            "— изучение клиента. <br />— определение потребности клиента. <br />— определение ценностного предложения вашего продукта. <br />— определение функций, которыми будет обладать минимальный жизнеспособный продукт (minimum viable product, MVP). <br />— создание прототипа MVP и выпуск MVP. <br />— продвижение продукта. <br />— изучение реакции пользователей. <br />— доработка продукта. <br /><a href='https://vc.ru/marketing/88908-product-market-fit-chto-eto-takoe-i-pochemu-bez-nego-startap-ne-vzletit'>product-market-fit</a>"
        ],
        ["Какой PMF у нашего продукта?", "..."],
        ["Ты разработчик или когда-то им был?", "Да или Нет."],
        [
            "Если твоя команда в ступоре и не знает как решить проблему, имеешь ли ты достаточный уровень знаний чтобы определить проблему и предложить возможные решения?",
            "Да или Нет."
        ],
        ["Как ты наставляешь, контролируешь и мотивируешь свою команду?", "..."],
        ["Как ты определяешь объем поставленной задачи и определяешь сроки? Аналогичная ситуация с проблемой.", "..."],
        [
            "Что такое mindmaps или ментальные карты?",
            "Mindmaps или ментальные карты (блок-схемы) — тип схем (графических моделей), описывающих алгоритмы или процессы, в которых отдельные шаги изображаются в виде блоков различной формы, соединённых между собой линиями, указывающими направление последовательности. (Информатика, 6 класс.)"
        ],
        [
            "Что такое KPI (Key Performance Indicators)?",
            "Показатели по которым оценивается эфективность работы сотрудника. (Например: У менеджера по продажам - колво-сделок, какое кол-во он делает в месяц, конверсия.)"
        ],
        ["Ты знаешь свой (KPI) - Какая твоя эффективность?", "..."],
        ["Твоя команда не успевает к дедлайну. Как ты поступишь?", "..."],
        [
            "Вышел из строя главный разработчик в твоей команде (уволился, заболел, не выходит на связь). Остальная команда не может без него работать т.к не достаточно подготовлена для такой работы. Как ты поступишь?",
            "..."
        ],
        [
            "Как ты готовишь еженедельный отчет о проделанной работе для руководства, в каком виде и формате?",
            "Необходимо показать пример своей еженедельной отчетности руководству."
        ],
        [
            "Как ты будешь подбирать сотрудника в свою команду?",
            "Представим ситуацию. Неопытные разработчики попросили тебя найти нового сильного сотрудника. Как будет происходить его поиск если у коллектива не достаточно уровня знаний, чтобы провести собеседование? Решение одно. Нужно самому иметь высокий уровень знаний, для того чтобы найти нового сотрудника соответствующему твоим знаниям или превосходящему их."
        ]
    ],
    "hr": [
        ["Кто такой HR менеджер?", ""],
        [
            "Основные обязанности HR?",
            "Полный цикл поиска и подбора на вакантные должности структурных подразделений Компании различного уровня <br />- Составление профиля должностей и размещение вакансий <br />- Самостоятельный поиск кандидатов с использованием всех ресурсов кадрового рынка <br />- Оценка профессиональных и личностных компетенций кандидатов <br />- Сопровождение кандидатов (адаптация, мотивация, обучение, оценка) <br />- Активное участие в совершенствование HR-процессов Компании <br />- Анализ рынка труда для формирования кадровой политики. Формирование кадрового резерва: курирование программы подготовки и создание стратегической корпоративной концепции <br />- Ведение внутренней отчетности и документации <br />- Тестирование и оценка персонала, Оценка результативности деятельности, оценка 360 <br />- Развитие HR бренда компании "
        ],
        ["Как ты подбираешь персонал?", "..."],
        ["По каким параметрам ты отбираешь персонал?", "..."],
        ["Как ты проводишь тестирование и какими инструментами?", "..."],
        ["Как происходит отсев кандидатов?", "..."],
        ["Какая у нас оплата труда для каждой должности?", "..."],
        ["Какая у тебя мотивация?", "Выходит так, что набираются не квалифицированные специалисты, которые вредят компании. В последствии уходят к конкурентам и сливают данные."],
        ["Как ты коммуницируешь с персоналом и как часто?", "Она должна знать что, где, почему, какое самочувствие и настроение...Почему нас покинуло 2 хороших дизайнера?"],
        [
            "Что ты знаешь про индекс eNPS (Индекс-удовлетворенности сотрудника)?",
            "Индекс eNPS или employee Net Promoter Score — это индекс чистой лояльности сотрудников, позволяющий оценить их удовлетворенность компанией. Другими словами, довольны ли сотрудники работой в вашей компании и настроены на совместное развитие или же разочарованы сотрудничеством и готовы перейти к другому работодателю, как только на рынке появиться более выгодное предложение."
        ],
        ["Как проводится расчет индекса eNPS?", "..."],
        [
            "Что такое KPI (Key Performance Indicators)?",
            "Показатели по которым оценивается эфективность работы сотрудника. (Например: У менеджера по продажам - колво-сделок, какое кол-во он делает в месяц, конверсия.)"
        ],
        ["Ты знаешь свой (KPI) - Какая твоя эффективность?", "..."],
        ["Как ты мотивируешь персонал, удерживаешь его?", "..."],
        ["Какой у нас % удержания? ", "Сколько сотрудников покидает компанию, сколько давольных сотрудников."],
        ["...", "Консультант по криптовалюте."],
        [
            "Что такое blockchain?",
            "Технология блокчейн это непрерывная, последовательная цепочка блоков, выстроеная по определенным правилам, каждый блок которой содержит содержит в себе какую-либо информацию."
        ],
        [
            "Что такое блок и что в нем содержится?",
            "Блок состоит из заголовка и списка транзакции.В нем содержится hash-транзакции, номер предыдущего блока, номер своего блока, hash-суммы своего и предыдущего блока."
        ],
        [
            "Что смарт-контракт?",
            "Смарт-контракт — компьютерный алгоритм, предназначенный для формирования, контроля и предоставления информации о владении чем-либо. В более узком смысле под смарт-контрактом понимается набор функций и данных, находящихся по определённому адресу в блокчейне."
        ],
        ["Как ты взаимодействуешь с криптовалютой? Какие ты используешь.", "Отправить / получить или что-то большее?"],
        ["Назови 5 лучших валют по параметру MarketCap", "//coinmarketcap.com"],
        ["Что такое Stable Coin?", "Стабильная валюта <b>`Эквалент`</b> которой приравнен к USD."],
        [
            "Что такое Defi?",
            "Децентрализованные финансовые сервисы, или децентрализованные финансы (англ. Decentralized Finance, DeFi) — общее название для аналогов традиционных финансовых инструментов, реализованных в децентрализованной архитектуре."
        ],
        [
            "Что такое DAO?",
            "The DAO — новый тип организации, для описания которой лучше всего подходит сравнение с цифровой компанией, не привязанной к какому-либо юридическому лицу. Созданная с помощью неизменяемого кода, она управляется исключительно сообществом инвесторов, вложивших в нее средства в виде например: ETH (токенов, на которых работает Ethereum) и обменявших их на специальные DAO-токены."
        ],
        [
            "Как работают криптовалютные займы?",
            "Заемщик вводит на счет криптовалюту, затем создает заявку на получение займа, сумма которого не должна превышать 70% от текущей рыночной стоимости монет. После одобрения займа клиент выводит фиатные средства, а вернув долг, забирает свой криптоактив"
        ],
        ["Что такое пулы ликвидности?", "Пул ликвидности в криптовалюте – это запасы токенов, которые заблокированы на счету специального смарт-контракта."],
        [
            "Что такое NFT-токен?",
            "Каждая запись в блокчейне называется токеном. Однако в открытом блокчейне все токены равны друг другу и взаимозаменяемы. Это означает, что один токен можно заменить другим таким же токеном и ничего не изменится. Но технология Non Fungible Token (NFT) работает по-другому. Каждый невзаимозаменяемый токен является уникальным и его нельзя подделать, разделить или незаметно заменить. Такая организация идеально подходит для того, чтобы закрепить свои права на какой-либо уникальный объект, будь то произведение искусства в единственном экземпляре, предмет в компьютерной игре или даже недвижимость."
        ],
        ["В чем отличие CEX от DEX", "CEX - централизованная биржа, а DEX - децентрализованная."]
    ],
    "ceo": [
        [
            "Кто такой CEO?",
            "Главный исполнительный директор (Chief Executive Officer). Руководитель, генеральный директор. Должность CEO относится ко второму уровню управления —  административному, который соответствует непосредственному управлению компанией и всеми руководителями. Он может одновременно входить в совет директоров предприятия, который выступает первым уровнем управления."
        ],
        [
            "Какие у него должностные обязанности?",
            "Определяет глобальную стратегию развития компании, принимает ключевые решения, представляет организацию во внешней среде. Компетенции CEO — управление всеми сферами деятельности, поэтому он несёт полную законодательную ответственность за работу компании и её последствия. <br />организацию бесперебойного функционирования бизнеса; <br />стратегическое планирование развития; <br />анализ деятельности компании; <br />создание системы мотивации; <br />контроль соблюдения корпоративных норм; <br />проверку делопроизводства; <br />выявление негативных моментов и недостатков в рабочих процессах. "
        ],
        [
            "Назови 7 СЕО известных компаний?",
            "CEO Apple – Тим Кук; <br />CEO Amazon – Джефф Безоc; <br />CEO Microsoft – Сатья Наделла; <br />CEO Google – Сундар Пичаи; <br />CEO Facebook – Марк Цукерберг; <br />CEO Tesla – Илон Маск; <br />CEO Вконтакте – Андрей Рогозов."
        ],
        [
            "Ты считаешь что выполняешь примерно такую же работу как и они?",
            "Лол..CEO предполагает работу в большой компании со сложной структурой, глубокое погружение в бизнес-процессы, знание рынка и широкий, незашоренный критичный взгляд. Неслучайно должность СЕО является высокооплачиваемой и вершиной для менеджера."
        ],
        ["Что такое PMF (Product-Market Fit)? ***", "Это - соответствие продукта рынку. Один из главных показателей успешности стартапа."],
        [
            "Как достичь PMF? ***",
            "Необходимо создать ценное предложение, <b>которое не может родиться из точечных поправок в продукте — например, изменения дизайна/цвета и пр.</b> <br />Три составляющих PMF: <br />— Клиент (вы знаете, кому нужен ваш продукт), <br />— Проблема (вы решаете конкретную проблему Клиента) <br />— Решение (Клиент готов платить за это Решение)."
        ],
        [
            "8 шагов к достижению PMF? ***",
            "— изучение клиента. <br />— определение потребности клиента. <br />— определение ценностного предложения вашего продукта. <br />— определение функций, которыми будет обладать минимальный жизнеспособный продукт (minimum viable product, MVP). <br />— создание прототипа MVP и выпуск MVP. <br />— продвижение продукта. <br />— изучение реакции пользователей. <br />— доработка продукта. <br /><a href='https://vc.ru/marketing/88908-product-market-fit-chto-eto-takoe-i-pochemu-bez-nego-startap-ne-vzletit'>product-market-fit</a>"
        ],
        ["Какой PMF у нашего продукта?", "..."]
    ],
    "cto": [
        [
            "Кто такой CTO?",
            "Технический директор (Chief technology officer или Chief technical officer). Главный инженер, технический лидер или руководитель компании на текущей стадии ее развития, который отвечает за разработку и развитие новых продуктов. CTO — один из руководителей компании, отвечающий за разработку новых сервисов или продуктов, а также за оптимизацию производительности производства: управление процессами разработки в проектных командах, обучение и повышение квалификации сотрудников, внедрение и поддержка различных процессов внутри компании. CTO — это обязательно технический специалист с опытом самостоятельного решения инженерных задач."
        ],
        [
            "Какие у него обязанности?",
            "Основная обязанность СТО - помочь компании достичь своих финансовых и маркетинговых целей, используя инновационный технологический подход. Под этим подразумевают, что технический директор будет сочетать знания существующих и новых технологий, чтобы предоставить бизнесу наилучшие возможные решения в будущем. Как и все топ-менеджеры, CTO отвечает за компанию в целом, а не за какой-то ее продукт или сервис. Но, если CEO / CFO определяет, что компания делает и для кого, то задача CTO — обеспечить эффективное использование и распределение ресурсов компании, превратить выполнение проектов в контролируемые процессы с предсказуемыми результатами. <br />Основные обязанности CTO: <br />— Определение общих стратегий технического развития; <br />— Принятие глобальных технических решений; <br />— Внутренний технический арбитраж; <br />— Выбор технологий, которые будут использоваться в том или ином проекте; <br />— Оценка этих технологий в плане финансовых и временных затрат; <br />— Оценка длительности и трудоемкости проектов; <br />— Планирование и построение процессов разработки; <br />— Формирование команд разработчиков; <br />— Распределение задач между командами; <br />— Отслеживание продвижения проектов; <br />— Обеспечение темпа и качество разработки на максимально высоком уровне; <br />— Выбор и внедрение вспомогательных систем для разработки и администрации; <br />— Экспертные предложения по архитектуре или конкретным техническим решениям; <br />— Написание кода, обзоры кода, рефакторинг; <br />— Технический pre-sale ключевых проектов; <br />— Управление техническими рисками на проектах; <br />— Общение с другими отделами и топ-менеджерами компании (CEO, COO, CIO и др.); <br />— Координация работы департаментов; <br />— Технические собеседования с новыми сотрудниками; <br />— Оценка продуктивности сотрудников и решение об уровне их зарплат; <br />— Обучение сотрудников; <br />— Формирование рабочей атмосферы в коллективе, мотивация сотрудников; <br />— Написание ТЗ и делегирование задач ответственным за них сотрудникам; <br />— Разборы полетов с тимлидами:)"
        ],
        [
            "Какими навыками должен обладать CTO?",
            "Знания в технической области - в технической сфере жизненно важны предыдущий опыт и глубокие знания отрасли. Иногда технический директор может учиться попутно, в технических вопросах это немного сложнее. Технический директор, который постоянно находится в курсе последних тенденций, - хорошая ставка. <br />Стратегия - эффективный технический директор обычно может опираться на опыт и предвидеть путь к успеху через разработку цифровой стратегии. Управление продуктом. В сфере высоких технологий технология и продукт часто идут рука об руку. Главный технический директор должен понимать жизненный цикл продукта и понимать, как создавать новые продукты и поддерживать существующие. <br />Техническая смекалка в бизнесе - технический директор с чувством деловой доблести всегда является преимуществом, помогая удовлетворить потребности конечных пользователей. Для многих компаний это может заключить в себе роль технического директора - внедрение CRM и ERP и поддержку международных команд с техническими проблемами. <br />Навыки ведения переговоров и наставничество. Для того, чтобы их отделы работали эффективно, технический директор должен знать сильные и слабые стороны своих сотрудников и знать, как извлечь из них максимальную пользу. Способность вдохновлять людей и убеждать их в реалистичности вашего видения имеет свои преимущества. Хороший технический директор должен быть на кого-то достойным внимания. <br />Инженерное дело - технический директор должен иметь некоторый технический опыт. Направляет ли технический директор свое время на разработку программного обеспечения или платформ? В некоторых компаниях технический аспект играет большую роль. Со временем это может уменьшиться, и иногда технический директор вообще не требуется для программирования. <br />Безопасность и соответствие нормативным требованиям. Потребуется ли от вашего технического директора оптимизировать данные организации и управлять ими? В других отраслях безопасность и соответствие нормам обычно имеют гораздо больший приоритет. Понимание корпоративных рисков и стандартов может быть болезненным, но чрезвычайно ценным знанием."
        ],
        ["Ты ими обладаешь?", "Да или Нет."],
        [
            "Что такое Soft и Hard skills",
            "Hard skills - профессиональные навыки, которым можно научить и которые можно измерить. Для обучения hard skills необходимо усвоить знания и инструкции, качество обучения можно проверить с помощью экзамена. Примеры hard skills: набор текста на компьютере, вождение автомобиля, чтение, математика, знание иностранного языка, использование компьютерных программ. <br />Soft skills — под этим термином подразумевают широкий спектр умений. Он включает умение организовывать командную работу, вести переговоры и договариваться с коллегами, креативность, способность учиться и адаптироваться к изменениям. "
        ],
        [
            "Какие этапы должен пройти сотрудник, чтобы стать CTO?",
            "стажёр в отделе разработки; <br />младший разработчик; <br />разработчик; <br />старший разработчик; <br />руководитель группы разработчиков; <br />руководитель проекта; <br />CTO."
        ],
        ["Как ты формируешь виденье того, как очередная технология будет использоваться в компании?", "..."],
        ["Какие бизнес-цели приследует компания в которой ты работаешь?", "..."],
        ["Что такое PMF (Product-Market Fit)? ***", "Это - соответствие продукта рынку. Один из главных показателей успешности стартапа."],
        [
            "Как достичь PMF? ***",
            "Необходимо создать ценное предложение, <b>которое не может родиться из точечных поправок в продукте — например, изменения дизайна/цвета и пр.</b> <br />Три составляющих PMF: <br />— Клиент (вы знаете, кому нужен ваш продукт), <br />— Проблема (вы решаете конкретную проблему Клиента) <br />— Решение (Клиент готов платить за это Решение)."
        ],
        [
            "8 шагов к достижению PMF? ***",
            "— изучение клиента. <br />— определение потребности клиента. <br />— определение ценностного предложения вашего продукта. <br />— определение функций, которыми будет обладать минимальный жизнеспособный продукт (minimum viable product, MVP). <br />— создание прототипа MVP и выпуск MVP. <br />— продвижение продукта. <br />— изучение реакции пользователей. <br />— доработка продукта. <br /><a href='https://vc.ru/marketing/88908-product-market-fit-chto-eto-takoe-i-pochemu-bez-nego-startap-ne-vzletit'>product-market-fit</a>"
        ],
        ["Какой PMF у нашего продукта?", "..."],
        ["Что такое жизненный цикл проекта?", "Жизненный цикл проекта – это набор стадий или этапов, которые необходимо пройти для получения заданного результата."],
        ["Как ты проводишь анализ отчетов по текущим проектам и персоналу?", "..."],
        ["Как ты проводишь интервью с потенциальными сотрудниками?", "..."],
        ["Чему ты можешь научить команду?", "..."]
    ]
}
